; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v11 ?v7)
             (pred_3 ?v3 ?v1)
             (pred_2 ?v11 ?v1)
             (pred_1 ?v6 ?v11 )
	     (pred_11 ?v11)
             (pred_7 ?v5)
             (pred_5 ?v3)
             (pred_12 ?v1)
             (pred_4 ?v11)
             (pred_10 ?v3)
             (pred_6 ?v11)
             (pred_8 ))



(:action op_4
:parameters (?v12 ?v4 ?v9 ?v13)
:precondition (and (pred_7 ?v12) (pred_7 ?v4) (pred_5 ?v9) (pred_12 ?v13)
          (pred_9 ?v12 ?v4) (pred_3 ?v9 ?v13)
                   (pred_2 ?v4 ?v13) (pred_11 ?v12) 
                   (pred_4 ?v4) (pred_10 ?v9))
:effect (and  (pred_6 ?v4) (not (pred_4 ?v4))))


(:action op_2
:parameters (?v12 ?v2)
:precondition (and (pred_7 ?v12) (pred_7 ?v2)
               (pred_11 ?v12) (pred_9 ?v12 ?v2) (pred_6 ?v2))
:effect (and (pred_11 ?v2) (not (pred_11 ?v12))))

(:action op_1
:parameters (?v12 ?v9)
:precondition (and (pred_7 ?v12) (pred_5 ?v9) 
                  (pred_11 ?v12) (pred_1 ?v9 ?v12) (pred_8 ))
:effect (and (pred_10 ?v9)
   (not (pred_1 ?v9 ?v12)) (not (pred_8 ))))


(:action op_5
:parameters (?v12 ?v10 ?v8)
:precondition (and (pred_7 ?v12) (pred_5 ?v10) (pred_5 ?v8)
                  (pred_11 ?v12) (pred_10 ?v8) (pred_1 ?v10 ?v12))
:effect (and (pred_10 ?v10) (pred_1 ?v8 ?v12)
        (not (pred_10 ?v8)) (not (pred_1 ?v10 ?v12))))

(:action op_3
:parameters (?v12 ?v9)
:precondition (and (pred_7 ?v12) (pred_5 ?v9) 
                  (pred_11 ?v12) (pred_10 ?v9))
:effect (and (pred_8 ) (pred_1 ?v9 ?v12) (not (pred_10 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_29 obj_22 obj_26 obj_16 obj_20 obj_31 obj_18 obj_06 obj_21 obj_03 obj_04 obj_09 obj_15 obj_10 obj_25 obj_14 obj_19 obj_17 obj_27 obj_01 obj_05 obj_11 obj_02 obj_13
    obj_24 obj_08 obj_07
    obj_28 obj_23 obj_12
    )

    (:init
       (pred_8)

       (pred_7 obj_30)
       (pred_7 obj_29)
       (pred_7 obj_22)
       (pred_7 obj_26)
       (pred_7 obj_16)
       (pred_7 obj_20)
       (pred_7 obj_31)
       (pred_7 obj_18)
       (pred_7 obj_06)
       (pred_7 obj_21)
       (pred_7 obj_03)
       (pred_7 obj_04)
       (pred_7 obj_09)
       (pred_7 obj_15)
       (pred_7 obj_10)
       (pred_7 obj_25)
       (pred_7 obj_14)
       (pred_7 obj_19)
       (pred_7 obj_17)
       (pred_7 obj_27)
       (pred_7 obj_01)
       (pred_7 obj_05)
       (pred_7 obj_11)
       (pred_7 obj_02)
       (pred_7 obj_13)
       (pred_12 obj_24)
       (pred_12 obj_08)
       (pred_12 obj_07)
       (pred_5 obj_28)
       (pred_5 obj_23)
       (pred_5 obj_12)

       (pred_9 obj_30 obj_20)
       (pred_9 obj_30 obj_29)
       (pred_9 obj_29 obj_31)
       (pred_9 obj_29 obj_22)
       (pred_9 obj_29 obj_30)
       (pred_9 obj_22 obj_18)
       (pred_9 obj_22 obj_26)
       (pred_9 obj_22 obj_29)
       (pred_9 obj_26 obj_06)
       (pred_9 obj_26 obj_16)
       (pred_9 obj_26 obj_22)
       (pred_9 obj_16 obj_21)
       (pred_9 obj_16 obj_26)
       (pred_9 obj_20 obj_03)
       (pred_9 obj_20 obj_31)
       (pred_9 obj_20 obj_30)
       (pred_9 obj_31 obj_04)
       (pred_9 obj_31 obj_18)
       (pred_9 obj_31 obj_29)
       (pred_9 obj_31 obj_20)
       (pred_9 obj_18 obj_09)
       (pred_9 obj_18 obj_06)
       (pred_9 obj_18 obj_22)
       (pred_9 obj_18 obj_31)
       (pred_9 obj_06 obj_15)
       (pred_9 obj_06 obj_21)
       (pred_9 obj_06 obj_26)
       (pred_9 obj_06 obj_18)
       (pred_9 obj_21 obj_10)
       (pred_9 obj_21 obj_16)
       (pred_9 obj_21 obj_06)
       (pred_9 obj_03 obj_25)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_03 obj_20)
       (pred_9 obj_04 obj_14)
       (pred_9 obj_04 obj_09)
       (pred_9 obj_04 obj_31)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_09 obj_15)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_09 obj_04)
       (pred_9 obj_15 obj_17)
       (pred_9 obj_15 obj_10)
       (pred_9 obj_15 obj_06)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_10 obj_27)
       (pred_9 obj_10 obj_21)
       (pred_9 obj_10 obj_15)
       (pred_9 obj_25 obj_01)
       (pred_9 obj_25 obj_14)
       (pred_9 obj_25 obj_03)
       (pred_9 obj_14 obj_05)
       (pred_9 obj_14 obj_19)
       (pred_9 obj_14 obj_04)
       (pred_9 obj_14 obj_25)
       (pred_9 obj_19 obj_11)
       (pred_9 obj_19 obj_17)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_19 obj_14)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_17 obj_27)
       (pred_9 obj_17 obj_15)
       (pred_9 obj_17 obj_19)
       (pred_9 obj_27 obj_13)
       (pred_9 obj_27 obj_10)
       (pred_9 obj_27 obj_17)
       (pred_9 obj_01 obj_05)
       (pred_9 obj_01 obj_25)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_14)
       (pred_9 obj_05 obj_01)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_19)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_02 obj_13)
       (pred_9 obj_02 obj_17)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_13 obj_27)
       (pred_9 obj_13 obj_02)
       (pred_4 obj_27)
       (pred_4 obj_06)
       (pred_4 obj_22)
       (pred_2  obj_27 obj_24)
       (pred_2  obj_06 obj_08)
       (pred_2  obj_22 obj_07)
       (pred_6 obj_30)
       (pred_6 obj_29)
       (pred_6 obj_26)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_31)
       (pred_6 obj_18)
       (pred_6 obj_21)
       (pred_6 obj_03)
       (pred_6 obj_04)
       (pred_6 obj_09)
       (pred_6 obj_15)
       (pred_6 obj_10)
       (pred_6 obj_25)
       (pred_6 obj_14)
       (pred_6 obj_19)
       (pred_6 obj_17)
       (pred_6 obj_01)
       (pred_6 obj_05)
       (pred_6 obj_11)
       (pred_6 obj_02)
       (pred_6 obj_13)

       (pred_3  obj_28 obj_24)
       (pred_3  obj_23 obj_08)
       (pred_3  obj_12 obj_07)
       (pred_1 obj_28 obj_19)
       (pred_1 obj_23 obj_04)
       (pred_1 obj_12 obj_05)
       (pred_11 obj_20)
    )

    (:goal (and
       (pred_1 obj_28 obj_21)
       (pred_1 obj_23 obj_06)
    ))
(:constraints
  (always (not (pred_11 obj_31)))
)
)

; plan
1. (op_2 obj_20 obj_03)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_03)
   goals met: 0 of 2
2. (op_2 obj_03 obj_04)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_04)
   goals met: 0 of 2
3. (op_2 obj_04 obj_09)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_09)
   goals met: 0 of 2
4. (op_2 obj_09 obj_19)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_19)
   goals met: 0 of 2
5. (op_1 obj_19 obj_28)
   deleted: (pred_1 obj_28 obj_19) (pred_8)
   added: (pred_10 obj_28)
   goals met: 0 of 2
6. (op_2 obj_19 obj_09)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_09)
   goals met: 0 of 2
7. (op_2 obj_09 obj_04)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_04)
   goals met: 0 of 2
8. (op_5 obj_04 obj_23 obj_28)
   deleted: (pred_10 obj_28) (pred_1 obj_23 obj_04)
   added: (pred_10 obj_23) (pred_1 obj_28 obj_04)
   goals met: 0 of 2
9. (op_2 obj_04 obj_09)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_09)
   goals met: 0 of 2
10. (op_2 obj_09 obj_18)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_18)
   goals met: 0 of 2
11. (op_4 obj_18 obj_06 obj_23 obj_08)
   deleted: (pred_4 obj_06)
   added: (pred_6 obj_06)
   goals met: 0 of 2
12. (op_2 obj_18 obj_06)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_06)
   goals met: 0 of 2
13. (op_3 obj_06 obj_23)
   deleted: (pred_10 obj_23)
   added: (pred_8) (pred_1 obj_23 obj_06)
   goals met: 1 of 2
14. (op_2 obj_06 obj_18)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_18)
   goals met: 1 of 2
15. (op_2 obj_18 obj_09)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_09)
   goals met: 1 of 2
16. (op_2 obj_09 obj_04)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_04)
   goals met: 1 of 2
17. (op_1 obj_04 obj_28)
   deleted: (pred_1 obj_28 obj_04) (pred_8)
   added: (pred_10 obj_28)
   goals met: 1 of 2
18. (op_2 obj_04 obj_09)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_09)
   goals met: 1 of 2
19. (op_2 obj_09 obj_18)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_18)
   goals met: 1 of 2
20. (op_2 obj_18 obj_06)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_06)
   goals met: 1 of 2
21. (op_2 obj_06 obj_21)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_21)
   goals met: 1 of 2
22. (op_3 obj_21 obj_28)
   deleted: (pred_10 obj_28)
   added: (pred_8) (pred_1 obj_28 obj_21)
   goals met: 2 of 2
